Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/edc/PIC32CM1216LE00048.PIC
      <edc:SFRDef edc:_addr="0xE000E41C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR7" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E420" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR8" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E424" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR9" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E428" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR10" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E42C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR11" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E430" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR12" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR13" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E438" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR14" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E43C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR15" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E440" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR16" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
